Revit 2024 API
SlabShapeVertexArray.Append Method
Add the item to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual void Append(
	SlabShapeVertex item
)
Visual Basic
Public Overridable Sub Append ( _
	item As SlabShapeVertex _
)
Visual C++
public:
virtual void Append(
	SlabShapeVertex^ item
)
Parameters
item
Type: Autodesk.Revit.DB.SlabShapeVertex
The item to be added.
See Also
SlabShapeVertexArray Class
Autodesk.Revit.DB Namespace